reviews/2013/2013-06-30-monthly-review.md
---
title: Monthly review: June, 2013 
tags: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Accomplished last month</a>
<ul>
<li><a href="#sec-1-1">Review Items <code>[4/4]</code></a></li>
<li><a href="#sec-1-2">Reading</a></li>
<li><a href="#sec-1-3">Learn</a></li>
<li><a href="#sec-1-4">Work</a></li>
<li><a href="#sec-1-5">Life</a></li>
<li><a href="#sec-1-6">Emacs</a></li>
<li><a href="#sec-1-7">Reviews</a></li>
</ul>
</li>
<li><a href="#sec-2">Plans for next month</a>
<ul>
<li><a href="#sec-2-1">Work</a></li>
<li><a href="#sec-2-2">Life</a></li>
<li><a href="#sec-2-3">Reading</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Accomplished last month</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Review Items <code>[4/4]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><code>[X]</code> Review monthly agenda F12 a v m 
</li>
<li><code>[X]</code> Check clocking data for this month v c b
</li>
<li><code>[X]</code> Review clock report for this month R
</li>
<li><code>[X]</code> Check where we spent time (too much or too little) and rectify this week
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Reading</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>the Gradle book
</li>
<li>人为什么活着
</li>
<li>JQuery ref
</li>
<li>Pro Git
</li>
<li>The Art of Uninx 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Learn</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>PHP
</li>
<li>Gradle build tool
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Work</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>finished the proj.asia
</li>
<li>finished the 20000.asia
</li>
<li>got a part time project, but not started yet
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Life</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>lost weight 2kg
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Emacs</h3>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Reviews</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>BIZ 118 hours (only 5 hours per day)
</li>
<li>GTD 5.5 hours 
</li>
<li>LEARN 45 hours
</li>
<li>SLEEP 262 hours (8.7 hours per day)
</li>
<li>iEmacs 2.2 hours 
</li>

<li><a href="./2013-06-02-weekly-review.html">Weekly Review @ 2013-06-02</a>
</li>
<li><a href="./2013-06-09-weekly-review.html">Weekly Review @ 2013-06-09</a>
</li>
<li><a href="./2013-06-16-weekly-review.html">Weekly Review @ 2013-06-16</a>
</li>
<li><a href="./2013-06-23-weekly-review.html">Weekly Review @ 2013-06-23</a>
</li>
<li><a href="./2013-06-30-weekly-review.html">Weekly review @ 2013-06-30</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Plans for next month</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Work</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> finish the gift website
</li>
<li><code>[&#xa0;]</code> find a job 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Life</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> go back home town
</li>
<li><code>[&#xa0;]</code> drink beer less
</li>
<li><code>[&#xa0;]</code> lost weight &lt; 70kg
</li>
<li><code>[&#xa0;]</code> open taobao account
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Reading</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> some baddahist books
</li>
</ul>
</div>
</div>
</div>
